ConfigFiles/InformationRegisters/ПраваДоступаКОбъектамМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПраваДоступаКОбъектамМетаданных</Name>
			<Comment>Загружаемые права.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоляБезОграниченияДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоляСОграничениемДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПолейБезОграниченияДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПолейСОграничениемДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Требуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяНеРавноИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПраваДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/ПраваДоступаКОбъектамМетаданных/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удаление строк, для которых право не требуется, не используется, но без комментариев.
	// Для неудаленных строк установим автоматический флажок ТребуетсяНеРавноИспользуется.
	НомерЗаписи = Количество() - 1;
	Пока НомерЗаписи >= 0 Цикл
		
		Если НЕ ЭтотОбъект[НомерЗаписи].Требуется И
		     НЕ ЭтотОбъект[НомерЗаписи].Используется И
		     ПустаяСтрока(ЭтотОбъект[НомерЗаписи].Комментарии) Тогда
			ЭтотОбъект.Удалить(НомерЗаписи);
		Иначе
			ЭтотОбъект[НомерЗаписи].ТребуетсяНеРавноИспользуется = ЭтотОбъект[НомерЗаписи].Требуется <> ЭтотОбъект[НомерЗаписи].Используется;
			
			Если НЕ ЭтотОбъект[НомерЗаписи].Используется Тогда
				ЭтотОбъект[НомерЗаписи].ПоляБезОграниченияДоступа = "";
				ЭтотОбъект[НомерЗаписи].ПоляСОграничениемДоступа  = "";
				ЭтотОбъект[НомерЗаписи].КоличествоПолейБезОграниченияДоступа = 0;
				ЭтотОбъект[НомерЗаписи].КоличествоПолейСОграничениемДоступа  = 0;
			КонецЕсли;
		КонецЕсли;
		
		НомерЗаписи = НомерЗаписи - 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
